export const info = {
  desc: [
    '组件接收多种属性，包括类型(type)、是否带下划线(underline)、是否禁用(disabled)、链接地址(href)、链接打开方式(target)和图标名称(icon)。',
    '当链接被禁用时，点击事件会被阻止，并且链接将失去交互性，样式也会变为禁用状态。',
    '组件支持插槽(slot)，允许用户在链接前插入自定义图标。',
    '链接会根据其类型显示不同的颜色，并且在鼠标悬停时颜色会发生变化。',
    '如果链接设置了下划线属性且未被禁用，那么在鼠标悬停时链接文本会显示下划线。',
    '禁用状态下的链接文本颜色将变为预定义的颜色，并且鼠标指针会变为不允许点击的样式。'
  ],
  author: '一勺',
  avatar: 'https://pic1.imgdb.cn/item/67d105e6066befcec6e39e31.jpg',
  version: '1.0.0',
  path: '/link',
  createdAt: '2025-3-13'
}
